# ตัวดำเนินการทางคณิตศาสตร์
x = 10
y = 3

print("ผลบวก" , x+y)
print("ผลลบ" , x-y)
print("ผลคูณ", x*y)
print("ผลหาร",x/y)
print("หารปัดเศษ", x//y)
print("ยกกำลัง",x**y)
print("หารเอาเศษ",x%y)

## อาจมีคำถามว่า Floor Division กับ Modulus มีประโยชน์อะไร ? 
# หากเรามองการหารเป็นการแบ่งกลุ่มก็จะเห็นประโยชน์ชัดขึ้น
# เช่น มีผู้โดยสาร 110 คน และมีรถโดยสารที่รองรับได้ 20 คนต่อคัน 
# ถ้าเรานำเอา 110 // 20 ก็จะได้ 5  นั้นคือเราต้องเตรียมรถ 5 คันละ 
# และเอา 110 % 20 ก็จะได้ 10  ที่เราก็ได้ทางเลือกละ 
# ว่าจะกระจายผู้โดยสารที่เหลือไปในรถ 5 คัน ๆ ละคน 
# หรือจะหารถเพิ่มดี แบบนี้เป็นต้น

a = x/y # ทศนิยม floating point

print("%.2f" % a)
print(round(a,2))
print("%.2f" % round(a, 2))
print("{:.2f}".format(a))
print("{:.2f}".format(round(a, 2)))
print("{:.15f}".format(round(a, 2)))